---
kind: type
id: T:Autodesk.Revit.DB.AddInId
source: html/31859d69-72c7-03fb-83e1-5c7719dca253.htm
---
# Autodesk.Revit.DB.AddInId

Identifies an AddIn registered with Revit

## Syntax (C#)
```csharp
public class AddInId : IDisposable
```